#Дано n-значное целое число N. Определить: входят ли в него цифры 3 и 7.

number = input("Введите число:")
print(('3' in number) and ('7' in number))
