# Напишите тип ошибки, возникающей при работе следующего кода:
def linear_solve(a, b):
    return b/a
# 0*x = 1
    print(linear_solve(0, 1))
